stator_orig/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rotationcentre (0 0 0);

// This application/dictionary controls:
// - optional: create new patches from boundary faces (either given as
//   a set of patches or as a faceSet)
// - always: order faces on coupled patches such that they are opposite. This
//   is done for all coupled faces, not just for any patches created.
// - optional: synchronise points on coupled patches.
// - always: remove zero-sized (non-coupled) patches (that were not added)

// 1. Create cyclic:
// - specify where the faces should come from
// - specify the type of cyclic. If a rotational specify the rotationAxis
//   and centre to make matching easier
// - always create both halves in one invocation with correct 'neighbourPatch'
//   setting.
// - optionally pointSync true to guarantee points to line up.

// 2. Correct incorrect cyclic:
// This will usually fail upon loading:
//  "face 0 area does not match neighbour 2 by 0.0100005%"
//  " -- possible face ordering problem."
// - in polyMesh/boundary file:
//      - loosen matchTolerance of all cyclics to get case to load
//      - or change patch type from 'cyclic' to 'patch'
//        and regenerate cyclic as above

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Patches to create.
patches
(
    {
        name overset1;
        patchInfo
        {
            type overset;
        }
        constructFrom patches;
        patches ();
    }
/*
    {
        name overset2;
        patchInfo
        {
            type overset;
        }
        constructFrom patches;
        patches ();
    }

    {
        name overset3;
        patchInfo
        {
            type overset;
        }
        constructFrom patches;
        patches ();
    }
*/
    {
        name inlet;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches (stator_inlet);
    }

    {
        name outlet;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches (stator_outlet);
    }

    {
        name side;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches (stator_side1 stator_side2 stator_side3 stator_side4);
    }

);

// ************************************************************************* //
