stator_orig/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \      /  F ield         | cfMesh: A library for mesh generation          | 
|  \    /   O peration     |                                                |
|   \  /    A nd           | Author: Franjo Juretic                         | 
|    \/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
*---------------------------------------------------------------------------*/

FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "stator.stl";

maxCellSize 20;

objectRefinements
{
	oversetRefinement
	{
		type				cone;
		cellSize			2.5;
		p0				(-10 0 0);
		p1				(10 0 0);
		radius0				55;
		radius1				55;
	}
}



// ************************************************************************* //
