stator_orig/0_org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

/*internalField   uniform	0.24; //Motorbike*/
/*internalField   uniform 1.;*/
internalField   uniform 1.98;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    side
    {
		type	slip;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    blade1
    {
		type	kqRWallFunction;
		value	uniform	0;
    }
/*
    blade2
    {
		type	kqRWallFunction;
		value	uniform	0;
    }

    blade3
    {
		type	kqRWallFunction;
		value	uniform	0;
    }
*/
    overset1
    {
        type            overset;
    }
/*
    overset2
    {
        type            overset;
    }

    overset3
    {
        type            overset;
    }
*/
}


// ************************************************************************* //
