stator_orig/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue zoneID 0
);

regions
(
    // Set cell values
    // (does zerogradient on boundaries)
    cellToCell
    {
        set region0;

        fieldValues
        (
            volScalarFieldValue zoneID 0
        );
    }

    cellToCell
    {
        set region1;

        fieldValues
        (
            volScalarFieldValue zoneID 1
        );
    }
/*
    cellToCell
    {
        set region2;

        fieldValues
        (
            volScalarFieldValue zoneID 2
        );
    }

    cellToCell
    {
        set region3;

        fieldValues
        (
            volScalarFieldValue zoneID 3
        );
    }
*/
);

// ************************************************************************* //
